---
kind: type
id: T:Autodesk.Revit.DB.HermiteSplineTangents
source: html/b77a59cc-229c-52c4-5bc4-94670f5d3571.htm
---
# Autodesk.Revit.DB.HermiteSplineTangents

This class indicates tangency at the start, the end, or both ends of the curve.

## Syntax (C#)
```csharp
public class HermiteSplineTangents : IDisposable
```

## Remarks
Initially, the tangent vectors will not be set, and no tangency condition will be imposed when the
 curve is created.